'''

Выведите числа из примера
на for c функцией range() (3.2.4)
в обратном порядке.

'''

for i in range(106, 5, -25):
	print(i)
